tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Searches a binary image for embedded files and executable code
brew "binwalk"
# Core application library for C
brew "glib"
# Manage compile and link flags for libraries
brew "pkg-config"
# Tool Command Language
brew "tcl-tk"
# Vector graphics library with cross-device output support
brew "cairo"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Run arbitrary commands when files change
brew "entr"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Identify or delete duplicate files
brew "fdupes"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Improved top (interactive process viewer)
brew "htop"
# Display an interface's bandwidth usage
brew "iftop"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Extract Digicam setting info from EXIF JPEG headers
brew "jhead"
# Prints information and tests integrity of JPEG/JFIF files
brew "jpeginfo"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Realtime console network usage monitor
brew "nload"
# Platform built on V8 to build network applications
brew "node"
# Find duplicate files based on content (NOT file names)
brew "rdfind"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# File system snapshot utility (based on rsync)
brew "rsnapshot"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Get, set, and list display resolution
brew "screenresolution"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Compressed read-only file system for Linux
brew "squashfs"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Application uninstaller
cask "appcleaner"
# Electronics prototyping platform
cask "arduino"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Virtual Audio Driver
cask "blackhole-16ch"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Disk space visualizer
cask "daisydisk"
# Universal database tool and SQL client
cask "dbeaver-community"
# Finds duplicate files in a computer system
cask "dupeguru"
# Web browser
cask "firefox"
# Password manager compatible with KeePass
cask "keeweb"
# Audio tagger focusing on efficiency
cask "kid3"
# Tool for designing and simulating digital logic circuits
cask "logisim"
# Warns about malware, adware and spyware
cask "malwarebytes"
# Open-source code snippets manager for developers
cask "masscode"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
cask "scidavis"
# Configurable document editor that supports Markdown
cask "typora"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Network protocol analyzer
cask "wireshark"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "123D Design", id: 566042322
mas "Apple Configurator 2", id: 1037126344
mas "Bitwarden", id: 1352778147
mas "Duplicate File Finder", id: 1032755628
mas "EasyFind", id: 411673888
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Shazam", id: 897118787
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Todoist", id: 585829637
